Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutorProxy.GetOutputSchemaId
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutorProxy.GetInputSchemaId
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutorProxy.ProcessInput(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExtensibleStorage.Entity)
document:
The snapshot document
inputData:
Necessary data to complete the task
Returns:
Combines the output data of the class, and a status to indicate
whether the task was able to finish successfully.
Since:
2027